tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf242_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF242_H_
#define _PIC18LF242_H_

#define PORTA                         0
#define AN0                           1
#define PORTA_RA0                     2
#define ULPWUIN                       3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFM                         8
#define AN3                           9
#define PORTA_RA3                     10
#define VREFP                         11
#define PORTA_RA4                     12
#define T0CKI                         13
#define AN4                           14
#define PORTA_RA5                     15
#define LVDIN                         16
#define SS                            17
#define CLKO                          18
#define PORTA_RA6                     19
#define OSC2                          20
#define PORTB                         21
#define INT0                          22
#define PORTB_RB0                     23
#define INT1                          24
#define PORTB_RB1                     25
#define INT2                          26
#define PORTB_RB2                     27
#define CCP2A                         28
#define PORTB_CCP2                    29
#define CCP2_PA2                      30
#define PORTB_RB3                     31
#define PORTB_RB4                     32
#define PGM                           33
#define PORTB_RB5                     34
#define PGC                           35
#define PORTB_RB6                     36
#define PGD                           37
#define PORTB_RB7                     38
#define PORTC                         39
#define T1CKI                         40
#define T1OSO                         41
#define PORTC_RC0                     42
#define PORTC_CCP2                    43
#define T1OSI                         44
#define PA2                           45
#define PORTC_RC1                     46
#define CCP1                          47
#define PA1                           48
#define PORTC_RC2                     49
#define SCL                           50
#define SCK                           51
#define PORTC_RC3                     52
#define SDA                           53
#define SDI                           54
#define PORTC_RC4                     55
#define SDO                           56
#define PORTC_RC5                     57
#define TX                            58
#define CK                            59
#define PORTC_RC6                     60
#define DT                            61
#define RX                            62
#define PORTC_RC7                     63
#define LATA                          64
#define LATA0                         65
#define LA0                           66
#define LATA1                         67
#define LA1                           68
#define LATA2                         69
#define LA2                           70
#define LATA3                         71
#define LA3                           72
#define LATA4                         73
#define LA4                           74
#define LATA5                         75
#define LA5                           76
#define LATA6                         77
#define LA6                           78
#define LATB                          79
#define LB0                           80
#define LATB0                         81
#define LB1                           82
#define LATB1                         83
#define LB2                           84
#define LATB2                         85
#define LB3                           86
#define LATB3                         87
#define LB4                           88
#define LATB4                         89
#define LB5                           90
#define LATB5                         91
#define LB6                           92
#define LATB6                         93
#define LB7                           94
#define LATB7                         95
#define LATC                          96
#define LATC0                         97
#define LC0                           98
#define LATC1                         99
#define LC1                           100
#define LATC2                         101
#define LC2                           102
#define LATC3                         103
#define LC3                           104
#define LATC4                         105
#define LC4                           106
#define LATC5                         107
#define LC5                           108
#define LATC6                         109
#define LC6                           110
#define LATC7                         111
#define LC7                           112
#define TRISA                         113
#define TRISA_RA0                     114
#define TRISA0                        115
#define TRISA_RA1                     116
#define TRISA1                        117
#define TRISA2                        118
#define TRISA_RA2                     119
#define TRISA_RA3                     120
#define TRISA3                        121
#define TRISA_RA4                     122
#define TRISA4                        123
#define TRISA_RA5                     124
#define TRISA5                        125
#define TRISA_RA6                     126
#define TRISA6                        127
#define TRISB                         128
#define TRISB_RB0                     129
#define TRISB0                        130
#define TRISB_RB1                     131
#define TRISB1                        132
#define TRISB_RB2                     133
#define TRISB2                        134
#define TRISB_CCP2                    135
#define TRISB_RB3                     136
#define TRISB3                        137
#define TRISB_RB4                     138
#define TRISB4                        139
#define TRISB_RB5                     140
#define TRISB5                        141
#define TRISB_RB6                     142
#define TRISB6                        143
#define TRISB_RB7                     144
#define TRISB7                        145
#define TRISC                         146
#define TRISC0                        147
#define TRISC_RC0                     148
#define TRISC1                        149
#define TRISC_CCP2                    150
#define TRISC_RC1                     151
#define TRISC2                        152
#define TRISC_RC2                     153
#define TRISC3                        154
#define TRISC_RC3                     155
#define TRISC4                        156
#define TRISC_RC4                     157
#define TRISC5                        158
#define TRISC_RC5                     159
#define TRISC6                        160
#define TRISC_RC6                     161
#define TRISC7                        162
#define TRISC_RC7                     163
#define PIE1                          164
#define TMR1IE                        165
#define TMR2IE                        166
#define CCP1IE                        167
#define SSPIE                         168
#define TXIE                          169
#define TX1IE                         170
#define RCIE                          171
#define RC1IE                         172
#define ADIE                          173
#define PIR1                          174
#define TMR1IF                        175
#define TMR2IF                        176
#define CCP1IF                        177
#define SSPIF                         178
#define TXIF                          179
#define TX1IF                         180
#define RCIF                          181
#define RC1IF                         182
#define ADIF                          183
#define IPR1                          184
#define TMR1IP                        185
#define TMR2IP                        186
#define CCP1IP                        187
#define SSPIP                         188
#define TX1IP                         189
#define TXIP                          190
#define RC1IP                         191
#define RCIP                          192
#define ADIP                          193
#define PIE2                          194
#define CCP2IE                        195
#define TMR3IE                        196
#define LVDIE                         197
#define BCLIE                         198
#define EEIE                          199
#define PIR2                          200
#define CCP2IF                        201
#define TMR3IF                        202
#define LVDIF                         203
#define BCLIF                         204
#define EEIF                          205
#define IPR2                          206
#define CCP2IP                        207
#define TMR3IP                        208
#define LVDIP                         209
#define BCLIP                         210
#define EEIP                          211
#define EECON1                        212
#define RD                            213
#define WR                            214
#define WREN                          215
#define WRERR                         216
#define FREE                          217
#define CFGS                          218
#define EEFS                          219
#define EEPGD                         220
#define RCSTA                         221
#define RCD8                          222
#define RX9D                          223
#define OERR                          224
#define FERR                          225
#define ADDEN                         226
#define CREN                          227
#define SREN                          228
#define SRENA                         229
#define RC8_9                         230
#define RC9                           231
#define RX9                           232
#define nRC8                          233
#define NOT_RC8                       234
#define SPEN                          235
#define TXSTA                         236
#define TXD8                          237
#define TX9D1                         238
#define TX9D                          239
#define TRMT                          240
#define TRMT1                         241
#define BRGH1                         242
#define BRGH                          243
#define SYNC                          244
#define SYNC1                         245
#define TXEN1                         246
#define TXEN                          247
#define TX91                          248
#define TX8_9                         249
#define TX9                           250
#define NOT_TX8                       251
#define nTX8                          252
#define CSRC1                         253
#define CSRC                          254
#define T3CON                         255
#define TMR3ON                        256
#define TMR3CS                        257
#define nT3SYNC                       258
#define NOT_T3SYNC                    259
#define T3SYNC                        260
#define T3INSYNC                      261
#define SOSCEN3                       262
#define T3CCP1                        263
#define T3CKPS                        264
#define T3CKPS0                       265
#define T3CKPS1                       266
#define T3CCP2                        267
#define T3CON_RD16                    268
#define RD163                         269
#define T3RD16                        270
#define CCP2CON                       271
#define CCP2M                         272
#define CCP2M0                        273
#define CCP2M1                        274
#define CCP2M2                        275
#define CCP2M3                        276
#define DC2B0                         277
#define CCP2Y                         278
#define DC2B                          279
#define DC2B1                         280
#define DCCPX                         281
#define CCP2X                         282
#define CCP1CON                       283
#define CCP1M0                        284
#define CCP1M                         285
#define CCP1M1                        286
#define CCP1M2                        287
#define CCP1M3                        288
#define CCP1Y                         289
#define DC1B                          290
#define DC1B0                         291
#define CCP1X                         292
#define DC1B1                         293
#define ADCON1                        294
#define PCFG0                         295
#define PCFG                          296
#define PCFG1                         297
#define PCFG2                         298
#define CHSN3                         299
#define PCFG3                         300
#define ADCS2                         301
#define ADFM                          302
#define ADCON0                        303
#define ADON                          304
#define nDONE                         305
#define GO_nDONE                      306
#define GO_DONE                       307
#define NOT_DONE                      308
#define GODONE                        309
#define DONE                          310
#define GO                            311
#define GO_NOT_DONE                   312
#define CHS                           313
#define CHS0                          314
#define CHS1                          315
#define CHS2                          316
#define ADCS                          317
#define ADCS0                         318
#define ADCAL                         319
#define ADCS1                         320
#define SSPCON2                       321
#define SEN                           322
#define RSEN                          323
#define PEN                           324
#define RCEN                          325
#define ACKEN                         326
#define ACKDT                         327
#define ACKSTAT                       328
#define GCEN                          329
#define SSPCON1                       330
#define SSPM0                         331
#define SSPM                          332
#define SSPM1                         333
#define SSPM2                         334
#define SSPM3                         335
#define CKP                           336
#define SSPEN                         337
#define SSPOV                         338
#define WCOL                          339
#define SSPSTAT                       340
#define BF                            341
#define UA                            342
#define R_NOT_W                       343
#define READ_WRITE                    344
#define NOT_W                         345
#define R_W                           346
#define RW                            347
#define R                             348
#define NOT_WRITE                     349
#define nW                            350
#define nWRITE                        351
#define R_nW                          352
#define I2C_READ                      353
#define START                         354
#define S                             355
#define I2C_START                     356
#define STOP                          357
#define I2C_STOP                      358
#define P                             359
#define NOT_A                         360
#define I2C_DATA                      361
#define nA                            362
#define D_nA                          363
#define D                             364
#define DA                            365
#define DATA_ADDRESS                  366
#define D_A                           367
#define D_NOT_A                       368
#define NOT_ADDRESS                   369
#define nADDRESS                      370
#define I2C_DAT                       371
#define CKE                           372
#define SMP                           373
#define T2CON                         374
#define T2CKPS0                       375
#define T2CKPS                        376
#define T2CKPS1                       377
#define TMR2ON                        378
#define TOUTPS0                       379
#define TOUTPS                        380
#define TOUTPS1                       381
#define TOUTPS2                       382
#define TOUTPS3                       383
#define PR2                           384
#define WM0                           385
#define WM1                           386
#define WAIT0                         387
#define WAIT1                         388
#define EBDIS                         389
#define T1CON                         390
#define TMR1ON                        391
#define TMR1CS                        392
#define NOT_T1SYNC                    393
#define T1SYNC                        394
#define nT1SYNC                       395
#define T1INSYNC                      396
#define T1OSCEN                       397
#define SOSCEN                        398
#define T1CKPS0                       399
#define T1CKPS                        400
#define T1CKPS1                       401
#define T1RD16                        402
#define T1CON_RD16                    403
#define RCON                          404
#define BOR                           405
#define NOT_BOR                       406
#define nBOR                          407
#define POR                           408
#define nPOR                          409
#define NOT_POR                       410
#define nPD                           411
#define NOT_PD                        412
#define PD                            413
#define NOT_TO                        414
#define nTO                           415
#define TO                            416
#define nRI                           417
#define NOT_RI                        418
#define RI                            419
#define nIPEN                         420
#define IPEN                          421
#define NOT_IPEN                      422
#define WDTCON                        423
#define SWDTE                         424
#define SWDTEN                        425
#define LVDCON                        426
#define LVDL0                         427
#define LVDL                          428
#define LVDL1                         429
#define LVDL2                         430
#define LVDL3                         431
#define LVDEN                         432
#define IRVST                         433
#define OSCCON                        434
#define SCS                           435
#define T0CON                         436
#define T0PS                          437
#define T0PS0                         438
#define T0PS1                         439
#define T0PS2                         440
#define PSA                           441
#define T0SE                          442
#define T0CS                          443
#define T08BIT                        444
#define TMR0ON                        445
#define STATUS                        446
#define C                             447
#define CARRY                         448
#define DC                            449
#define ZERO                          450
#define Z                             451
#define OV                            452
#define OVERFLOW                      453
#define N                             454
#define NEGATIVE                      455
#define INTCON3                       456
#define INT1IF                        457
#define INT1F                         458
#define INT2IF                        459
#define INT2F                         460
#define INT1E                         461
#define INT1IE                        462
#define INT2IE                        463
#define INT2E                         464
#define INT1P                         465
#define INT1IP                        466
#define INT2IP                        467
#define INT2P                         468
#define INTCON2                       469
#define RBIP                          470
#define TMR0IP                        471
#define T0IP                          472
#define INTEDG2                       473
#define INTEDG1                       474
#define INTEDG0                       475
#define RBPU                          476
#define NOT_RBPU                      477
#define nRBPU                         478
#define INTCON                        479
#define RBIF                          480
#define INT0F                         481
#define INT0IF                        482
#define T0IF                          483
#define TMR0IF                        484
#define RBIE                          485
#define INT0E                         486
#define INT0IE                        487
#define T0IE                          488
#define TMR0IE                        489
#define PEIE                          490
#define PEIE_GIEL                     491
#define GIEL                          492
#define GIE_GIEH                      493
#define GIE                           494
#define GIEH                          495
#define STKPTR0                       496
#define STKPTR                        497
#define SP0                           498
#define STKPTR1                       499
#define SP1                           500
#define STKPTR2                       501
#define SP2                           502
#define SP3                           503
#define STKPTR3                       504
#define STKPTR4                       505
#define SP4                           506
#define STKUNF                        507
#define STKOVF                        508
#define STKFUL                        509

#endif // _PIC18LF242_H_
